app/controllers/api/images_controller.rb

  def index
    Image.current_user = current_user if user_signed_in?
    page = params[:page]
    category_name = params[:category]

    if category_name.blank?
      images = Image.where(:published => true).all(:limit => 12, :offset => page, :order => "published_at DESC")
---
SELECT "images".* FROM "images" WHERE "images"."published" = 't'

  def like
    @image = Image.find(params[:id])
    if @image.cutes.where(:user_id => current_user.id).empty?
      Cute.create!(:user_id => current_user.id, :image_id => @image.id)
    else
      Cute.where(:user_id => current_user.id, :image_id => @image.id).first.destroy
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "cutes".* FROM "cutes" WHERE "cutes"."user_id" = 1 AND "cutes"."image_id" = 3 LIMIT 1
SELECT COUNT(*) FROM "cutes" WHERE "cutes"."image_id" = 3 AND "cutes"."user_id" = 1
INSERT INTO "cutes" ("created_at", "image_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 02 Dec 2012 06:43:09 UTC +00:00], ["image_id", 3], ["updated_at", Sun, 02 Dec 2012 06:43:09 UTC +00:00], ["user_id", 1]]
DELETE FROM "cutes" WHERE "cutes"."id" = ?  [["id", 117]]