app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    Image.current_user = current_user if user_signed_in?
    if params[:id].is_number?
      user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def user_likes
    Image.current_user = current_user if user_signed_in?
    user = User.find(params[:id])