app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
  def dashboard
    @images = current_user.images
    @products = Product.all.map { |p| p.title}.to_json