app/controllers/images_controller.rb

  def publish
    @image = Image.find(params[:id])
    if @image.user == current_user
      if @image.published != true
        @image.published = true
      else
        @image.published = false
      end
      @image.save!
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "images" SET "published" = 't', "updated_at" = '2012-12-02 03:25:27.074905' WHERE "images"."id" = 1