app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."instagram_id" = 228621 LIMIT 1
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "facebook", "facebook_token", "full_name", "image_url", "instagram", "instagram_id", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "tumblr", "tumblr_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "images" SET "location_name" = 'The Phone Booth', "title" = 'Drikin with #shatz', "low_url" = 'http://distilleryimage6.s3.amazonaws.com/482f48a0354511e2aaa222000a1fb843_6.jpg', "thumb" = 'http://distilleryimage6.s3.amazonaws.com/482f48a0354511e2aaa222000a1fb843_5.jpg', "user_id" = 1, "updated_at" = '2012-12-02 03:25:13.372446' WHERE "images"."id" = 2
UPDATE "users" SET "last_sign_in_at" = '2012-12-02 03:25:12.580556', "current_sign_in_at" = '2012-12-02 03:25:12.580556', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2012-12-02 03:25:12.581127' WHERE "users"."id" = 1
---
  def callback
    response = Instagram.get_access_token(params[:code], :redirect_uri => CALLBACK_URL)
    session[:access_token] = response.access_token
    client = Instagram.client(:access_token => session[:access_token])
    u = client.user
    if (user = User.find_by_instagram_id(u.id)).present?
      sign_in(user)
      user.refresh_images(session[:access_token])
      redirect_to :controller => :home, :action => :index
    else
      user = User.create(:email => "#{ (0...10).map{65.+(rand(26)).chr}.join}@email-something.com", :name => u.username)
      pwd = Devise.friendly_token.first(10)
      user.instagram_id = u.id
      user.full_name = u.full_name
      user.password = user.password_confirmation = pwd
      user.image_url = u.profile_picture
      user.bio = ActionController::Base.helpers.sanitize(u.bio)
      user.save!