app/views/products/_add_products.html.haml

  %ul
    -image.products.each do |p|
---
SELECT "products".* FROM "products" INNER JOIN "images_products" ON "products"."id" = "images_products"."product_id" WHERE "images_products"."image_id" = 1